In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import Imputer

In [2]:
a = ['Shubham', 'Vinayak', 'Badreesh', 'Aditya', 'Kuntal', 'Sneha']
var1 = [15,20,20,20,25,15]
var2 = [np.nan,np.nan,'X','Y','X','X']
var3 = [np.nan, 's','f', 's', 's', np.nan]

x = []
for i,j,k in zip(var1, var2, var3):
    x.append([i,j,k])

d = pd.DataFrame(x,index = a, columns = ['Num', 'Cat', 'Cat1'])

In [3]:
d

          Num  Cat Cat1
Shubham    15  NaN  NaN
Vinayak    20  NaN    s
Badreesh   20    X    f
Aditya     20    Y    s
Kuntal     25    X    s
Sneha      15    X  NaN

In [4]:
d.Cat = d.Cat.astype('category')
d.Cat1 = d.Cat1.astype('category')
d.dtypes

Num        int64
Cat     category
Cat1    category
dtype: object

In [5]:
d['Cat'].fillna(d['Cat'].value_counts().index[0])

Shubham     X
Vinayak     X
Badreesh    X
Aditya      Y
Kuntal      X
Sneha       X
Name: Cat, dtype: category
Categories (2, object): [X, Y]

In [6]:
cat_cols = ['Cat', 'Cat1']
sub_dict = {}
for i in cat_cols:
    sub_dict[i] = d[i].value_counts().index[0]

In [7]:
sub_dict

{'Cat': 'X', 'Cat1': 's'}

In [8]:
for i in sub_dict.keys():
    d[i] = d[i].fillna(sub_dict[i])

In [9]:
d

          Num Cat Cat1
Shubham    15   X    s
Vinayak    20   X    s
Badreesh   20   X    f
Aditya     20   Y    s
Kuntal     25   X    s
Sneha      15   X    s